In [2]:
import pandas as pd

In [14]:
df1 = pd.DataFrame({

    "ID": [10001, 10002, 30003, 40004, 50005, 9001],
    "Qty": [10, 20, 20, 40, 50, 20],
    "Category": ["A", "B", "C", "D", "E", 'E'],
})

df2 = pd.DataFrame({
    "ID": [10001, 10002, 30003, 60006, 70007, 9004],
    "Qty": [10, 20, 30, 40, 60, 20],
    "City": ["Lucknow", "HBH", "Chennai", "Delhi", "Jaipur", 'HBH']
})

In [7]:
df1.merge(df2)  # ID and Qty of df1 and City of df2

      ID  Qty Category     City
0  10001   10        A  Lucknow
1  10002   20        B      HBH

In [9]:
df1.merge(df2, how='inner')

      ID  Qty Category     City
0  10001   10        A  Lucknow
1  10002   20        B      HBH

In [11]:
df1.merge(df2, how='inner', on='ID')
df2.merge(df1, how='inner', on='ID')

      ID  Qty_x Category  Qty_y     City
0  10001     10        A     10  Lucknow
1  10002     20        B     20      HBH
2  30003     20        C     30  Chennai

      ID  Qty_x     City  Qty_y Category
0  10001     10  Lucknow     10        A
1  10002     20      HBH     20        B
2  30003     30  Chennai     20        C

In [12]:
df1.merge(df2, how='inner', on='Qty')

    ID_x  Qty Category   ID_y     City
0  10001   10        A  10001  Lucknow
1  10002   20        B  10002      HBH
2  10002   20        B   9004      HBH
3  30003   20        C  10002      HBH
4  30003   20        C   9004      HBH
5  40004   40        D  60006    Delhi
6   9001   20        E  10002      HBH
7   9001   20        E   9004      HBH

In [15]:
df1.merge(df2, how='inner', on=['ID', 'Qty'])

      ID  Qty Category     City
0  10001   10        A  Lucknow
1  10002   20        B      HBH

In [17]:
df1.merge(df2, how='outer')

      ID  Qty Category     City
0   9001   20        E      NaN
1   9004   20      NaN      HBH
2  10001   10        A  Lucknow
3  10002   20        B      HBH
4  30003   20        C      NaN
5  30003   30      NaN  Chennai
6  40004   40        D      NaN
7  50005   50        E      NaN
8  60006   40      NaN    Delhi
9  70007   60      NaN   Jaipur

In [23]:
df1.merge(df2, how='outer', on='ID')

      ID  Qty_x Category  Qty_y     City
0   9001   20.0        E    NaN      NaN
1   9004    NaN      NaN   20.0      HBH
2  10001   10.0        A   10.0  Lucknow
3  10002   20.0        B   20.0      HBH
4  30003   20.0        C   30.0  Chennai
5  40004   40.0        D    NaN      NaN
6  50005   50.0        E    NaN      NaN
7  60006    NaN      NaN   40.0    Delhi
8  70007    NaN      NaN   60.0   Jaipur

In [25]:
df1.merge(df2, how='left')

      ID  Qty Category     City
0  10001   10        A  Lucknow
1  10002   20        B      HBH
2  30003   20        C      NaN
3  40004   40        D      NaN
4  50005   50        E      NaN
5   9001   20        E      NaN

In [28]:
df1.merge(df2, how='right')
df1.merge(df2, how='left')

      ID  Qty Category     City
0  10001   10        A  Lucknow
1  10002   20        B      HBH
2  30003   30      NaN  Chennai
3  60006   40      NaN    Delhi
4  70007   60      NaN   Jaipur
5   9004   20      NaN      HBH

      ID  Qty Category     City
0  10001   10        A  Lucknow
1  10002   20        B      HBH
2  30003   20        C      NaN
3  40004   40        D      NaN
4  50005   50        E      NaN
5   9001   20        E      NaN

In [29]:
df1.merge(df2, how='cross')

     ID_x  Qty_x Category   ID_y  Qty_y     City
0   10001     10        A  10001     10  Lucknow
1   10001     10        A  10002     20      HBH
2   10001     10        A  30003     30  Chennai
3   10001     10        A  60006     40    Delhi
4   10001     10        A  70007     60   Jaipur
5   10001     10        A   9004     20      HBH
6   10002     20        B  10001     10  Lucknow
7   10002     20        B  10002     20      HBH
8   10002     20        B  30003     30  Chennai
9   10002     20        B  60006     40    Delhi
10  10002     20        B  70007     60   Jaipur
11  10002     20        B   9004     20      HBH
12  30003     20        C  10001     10  Lucknow
13  30003     20        C  10002     20      HBH
14  30003     20        C  30003     30  Chennai
15  30003     20        C  60006     40    Delhi
16  30003     20        C  70007     60   Jaipur
17  30003     20        C   9004     20      HBH
18  40004     40        D  10001     10  Lucknow
19  40004     40        D  10002     20      HBH
20  40004     40        D  30003     30  Chennai
21  40004     40        D  60006     40    Delhi
22  40004     40        D  70007     60   Jaipur
23  40004     40        D   9004     20      HBH
24  50005     50        E  10001     10  Lucknow
25  50005     50        E  10002     20      HBH
26  50005     50        E  30003     30  Chennai
27  50005     50        E  60006     40    Delhi
28  50005     50        E  70007     60   Jaipur
29  50005     50        E   9004     20      HBH
30   9001     20        E  10001     10  Lucknow
31   9001     20        E  10002     20      HBH
32   9001     20        E  30003     30  Chennai
33   9001     20        E  60006     40    Delhi
34   9001     20        E  70007     60   Jaipur
35   9001     20        E   9004     20      HBH

In [32]:
# Merge two tables so you only get employees whose departments exist.

employees = pd.DataFrame({
    "emp_id": [101, 102, 103, 104],
    "name": ["Alice", "Bob", "Charlie", "David"],
    "dept_id": [10, 20, 30, 40]
})

departments = pd.DataFrame({
    "dept_id": [10, 20, 30],
    "dept_name": ["HR", "Finance", "IT"]
})

employees.merge(departments, on='dept_id')

   emp_id     name  dept_id dept_name
0     101    Alice       10        HR
1     102      Bob       20   Finance
2     103  Charlie       30        IT

In [35]:
# Some students mistakenly got registered for courses that donâ€™t exist.
# Merge so that all students appear, regardless of whether their course exists.

students = pd.DataFrame({
    "roll_no": [1, 2, 3, 4],
    "student_name": ["John", "Emma", "Liam", "Sophia"],
    "course_id": [101, 102, 103, 104]
})

courses = pd.DataFrame({
    "course_id": [101, 102, 105],
    "course_name": ["Math", "Physics", "Biology"]
})

students.merge(courses, how='left')

   roll_no student_name  course_id course_name
0        1         John        101        Math
1        2         Emma        102     Physics
2        3         Liam        103         NaN
3        4       Sophia        104         NaN

In [47]:
# An e-commerce store has sales records for two years. The manager wants to check which orders belong to:
# 1. only 2024,
# 2. only 2025,
# 3. both years.

sales_2024 = pd.DataFrame({
    "order_id": [1, 2, 3],
    "product": ["Laptop", "Phone", "Tablet"]
})

sales_2025 = pd.DataFrame({
    "order_id": [3, 4, 5],
    "product": ["Tablet", "Monitor", "Headphones"]
})

mapping = {
    'left_only': 'Only 2024',
    'right_only': 'Only 2025',
    'both': 'Both years',
}

merged_df = pd.merge(sales_2024, sales_2025, on=[
                     'order_id', 'product'], how='outer', indicator=True)

merged_df['status'] = merged_df['_merge'].map(mapping)

sales_2024.merge(sales_2025, how='left')
sales_2024.merge(sales_2025, how='right')

   order_id product
0         1  Laptop
1         2   Phone
2         3  Tablet

   order_id     product
0         3      Tablet
1         4     Monitor
2         5  Headphones